name = "luka"
age = 10
height = 1.55
print(type(name))
print(type(age))

print(type(height))


print("-----------------------------------------------------------------------------------------------------------")



პროგრამა = int(input("შემოიტანე 1 რიცხვი> "))
პროგრამა2 = int(input("შემოიტანე მე - 2- ე რიცხვი> "))

print(პროგრამა/პროგრამა2)
print(პროგრამა*პროგრამა2)
print(პროგრამა-პროგრამა2)
print(პროგრამა+პროგრამა2)


print("--------------------------------------------------------------------------------------------------------")

one = 9/3
two = 9//3
print(one)
print(two)
#ამ ორ გაყოფას შორის განსხვავება ის არის რომ პირველ გაყოფას რიცხვი გამოაქვს float - ში ხოლო მეორეს integer - ში



print("------------------------------------------------------------------------------------------------------")

#tipe ფუნქცია გვეუბნება ჩვენს მიერ შექმნილი ცვლადის ტიპს ანუ იმას თუ რა ტიპისაა ცვლადი სტრინგის ინტეჯერის თუ ფლოუტის




#ჩენ იმისთვის რომ ჩვენი კოდი ლამაად ავღწეროთ ან ჩავსვათ იყნებთ კონკატენაცia









რაოდენობა = int(input("რამდენჯერ გიცდია ჩქმეტა?  "))
ხელის_მოქნევა = int(input("რამდენჯერ მოუქნიე ხელი? "))
print(რაოდენობა-ხელის_მოქნევა)