
grisha_statement = 3 < 5
misha_statement = 3 > 5

if grisha_statement:
 გამარჯვებული= "გრიშას"

else:
 გამარჯვებული = "მიშას"



print(f"პრიზი მიენიჭება: {გამარჯვებული}")


print("------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------")

grisha = 3 < 5
misha = 3 > 5

if grisha:
 
 გამარჯვებული = "გრიშას"


elif misha:
 გამარჯვებული = "მიშას"

else:
 გამარჯვებული = "ნიკას"



print(f"პრიზი მიენიჭება {გამარჯვებული}")